<?
$infos=get_user_info();
$name=$infos['name'];
$nick=$infos['nick'];
$url=$infos['url'];
$num=str_to_num($nick,$app_name);

if($num>41)
{
	$num=ceil($num/3);
}
if ($num == 0) {$num=1;}
$case=array();
$case[1]='乘坐动车上的天堂，具体死因不明。享年21岁。';
$case[2]='前世是医生，被患者注射不明液体而死。享年34岁。';
$case[3]='逛街时，被楼上掉下的的不明飞行物砸死。享年20岁。';
$case[4]='前世是黑帮老大，在火拼中被自己小弟误杀。享年32岁。';
$case[5]='被车撞倒，记车牌时被车主恼羞成怒灭口。享年24岁。';
$case[6]='得精神分裂症，把自己当仇人杀了。享年40岁。';
$case[7]='被车撞倒，记车牌时被车主恼羞成怒灭口。享年24岁。';
$case[8]='天台看风景被人当成跳楼，救你时不小心将你推下了楼。享年22岁';
$case[9]='跳伞时忘记打开降落伞，被摔成泥巴。享年28岁。';
$case[10]='露营，在草丛大便时被毒蛇咬到屁股，不治身亡。享年16岁。';
$case[11]='你前世死于奶粉中毒，享年半岁。(详细死因被屏蔽)';
$case[12]='Sorry，根据当地法律法规，此人死因为A级机密，不予泄露。';
$case[13]='对不起，您前世不属于人类，请使用动物前世死因分析应用查询。';
$case[14]='见义勇为被歹徒刺死，享年21岁。';
$case[15]='跳河救落水者，忘了自己不会游泳被淹死。享年27岁。';
$case[16]='与别人私通，捉奸在床被活活打死，享年30岁。';
$case[17]='厕所灯坏，不甚掉入粪坑而死，享年19岁。';
$case[18]='恋人跟别人跑了，为情跳河自杀。享年24岁。';
$case[19]='在浴室洗澡时踩到香皂摔死。享年13岁。';
$case[20]='学人家当古惑仔被乱刀砍死，享年17岁。';
$case[21]='过马路被自行车撞死。享年22岁。';
$case[22]='还未出生，就被堕胎了。享年0岁。';
$case[23]='因长相太过出众，被轮奸而死。享年21岁。';
$case[24]='因扶老太太过马路，被车撞死。享年22岁。';
$case[25]='当官公正廉洁，被人陷害而死。享年45岁。';
$case[26]='吃饭时太过急促被噎死。享年23岁。';
$case[27]='因做坏事太多，被雷劈死。享年33岁。';
$case[28]='被父母逼婚，跳河自杀。享年26岁。';
$case[29]='得病后因服用假药而死，享年40岁。';
$case[30]='一辈子无病无灾，正常死亡。享年89岁。';
$case[31]='因为家里太穷又要不到饭被活活饿死，享年23岁。';
$case[32]='在河里游泳时救生圈泄气被淹死，8岁。';
$case[33]='去人家果园偷苹果，从树上掉下来摔死，享年15岁。';
$case[34]='前世是警察，在执行任务时与歹徒搏斗被杀。享年30岁。';
$case[35]='前世患有先天性心脏病，与人吵架时被气死。享年34岁。';
$case[36]='与人赛车，经过山崖时把油门当刹车冲下了崖底。享年25岁。';
$case[37]='路边摆摊不交管理费被城管打死，享年45岁。';
$case[38]='中了500万大奖，回家路上被劫杀。享年29岁。';
$case[39]='搬入20年努力买的房子第二天发生地震被震死。享年42岁。';
$case[40]='因长相太过丑陋，出门被群众板砖砸死。享年21岁。';
$case[41]='职业小偷，行偷时不甚掉入茅坑而死。。享年23岁。';

$str=$case[$num];
$img_path='./imgs/qssy.png';
$img=getImgType($img_path);
$img=createImg($img,$nick."：",55,160,11,5,20,'f37','katong');
$img=createImg($img,$str,60,220,10,5,20);

$content='我刚刚查了'.$name.'的前世死因，原来'.$name.'前世是这么死的！哈哈~~！据《周易》记载，人前世的死和今生有着密切的联系...快来查查你的前世死因吧！#前世死因分析#：'.$url;
$content=$content.' ，你也试试吧！';


$pagrams = array();
$pagrams[content] = $content;
$pagrams[img] = $img;
$pagrams[type] = 'png';
//@账号内容会过多
$pagrams[url] = $url;
$pagrams[title] = "点击测试->前世死因分析";
$pagrams[summary] = "据《周易》记载，人前世的死和今生有着密切的联系...想知道你前世是怎么死的吗？快来分析一下吧~".$pagrams[url];
$rt_info=post_send2($pagrams);
$rt_info['result_title'] =  '【'.$str.'】';